TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x000A0C00) Test 0 register */
} M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS0_I2C_PAIR
  @{
*/

typedef struct {
  __IO uint32_t PAIR0;                             /* !< (@ 0x000A01C0) Pairing of I2C for MULTI-MASTER/SMBUS applications */
} M33C1SPGSS0_I2C_PAIR_Regs;

/*@}*/ /* end of group M33C1SPGSS0_I2C_PAIR */

/** @addtogroup M33C1SPGSS0_UNICOMM_LPBK
  @{
*/

typedef struct {
  __IO uint32_t LPBK0;                             /* !< (@ 0x000A0120) Loopback between SPG instances User has to ensure
                                                      that the SPGs looped back have the same underlying IP instantiated;
                                                      i.e. both UART, both SPI, both I2C, etc., */
} M33C1SPGSS0_UNICOMM_LPBK_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UNICOMM_LPBK */

/** @addtogroup M33C1SPGSS0_SPGSS_IPSPECIFIC
  @{
*/

typedef struct {
       uint32_t RESERVED0[8];
  M33C1SPGSS0_UNICOMM_LPBK_Regs  UNICOMM_LPBK;                      /* !< (@ 0x000A0120) */
       uint32_t RESERVED1[39];
  M33C1SPGSS0_I2C_PAIR_Regs  I2C_PAIR;                          /* !< (@ 0x000A01C0) */
} M33C1SPGSS0_SPGSS_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS0_SPGSS_IPSPECIFIC */

/** @addtogroup M33C1SPGSS0_UC2_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00085100) Mode Selection Register */
} M33C1SPGSS0_UC2_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC2_IPSPECIFIC */

/** @addtogroup M33C1SPGSS0_EXT_GPRCM_UC2_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00084800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00084804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00084808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00084814) Status Register */
} M33C1SPGSS0_EXT_GPRCM_UC2_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS0_EXT_GPRCM_UC2_GPRCM */

/** @addtogroup M33C1SPGSS0_EXT_GPRCM_UC2
  @{
*/

typedef struct {
  M33C1SPGSS0_EXT_GPRCM_UC2_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00084800) */
} M33C1SPGSS0_EXT_GPRCM_UC2_Regs;

/*@}*/ /* end of group M33C1SPGSS0_EXT_GPRCM_UC2 */

/** @addtogroup M33C1SPGSS0_UC1_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t IPMODE;                            /* !< (@ 0x00083100) Mode Selection Register */
} M33C1SPGSS0_UC1_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC1_IPSPECIFIC */

/** @addtogroup M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00082800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00082804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00082808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00082814) Status Register */
} M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_Regs;

/*@}*/ /* end of group M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM */

/** @addtogroup M33C1SPGSS0_EXT_GPRCM_UC1
  @{
*/

typedef struct {
  M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00082800) */
} M33C1SPGSS0_EXT_GPRCM_UC1_Regs;

/*@}*/ /* end of group M33C1SPGSS0_EXT_GPRCM_UC1 */

/** @addtogroup M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT
  @{
*/

typedef struct {
  __IO uint32_t TEST0;                             /* !< (@ 0x00045E00) Test 0 register */
  __IO uint32_t TEST1;                             /* !< (@ 0x00045E04) Test 0 register */
} M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT */

/** @addtogroup M33C1SPGSS0_UC2_I2CT_IPSPECIFIC
  @{
*/

typedef struct {
  __IO uint32_t CTR;                               /* !< (@ 0x00045100) I2C Target Control Register */
  __IO uint32_t ACKCTL;                            /* !< (@ 0x00045104) I2C Target ACK Control */
  __I  uint32_t SR;                                /* !< (@ 0x00045108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0004510C) Interrupt FIFO Level Select Register */
       uint32_t RESERVED0[2];
  __IO uint32_t GFCTL;                             /* !< (@ 0x00045118) I2C Glitch Filter Control */
       uint32_t RESERVED1;
  __O  uint32_t TTXDATA;                           /* !< (@ 0x00045120) I2C TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00045124) I2C RXData */
  __I  uint32_t PECSR;                             /* !< (@ 0x00045128) PEC status register */
       uint32_t RESERVED2[7];
  __IO uint32_t OAR2;                              /* !< (@ 0x00045148) Own Address 2 */
  __IO uint32_t OAR;                               /* !< (@ 0x0004514C) I2C Own Address */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00045150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00045154) I2C Timeout Count Control Register */
  __IO uint32_t PECCTL;                            /* !< (@ 0x00045158) I2C PEC control register */
} M33C1SPGSS0_UC2_I2CT_IPSPECIFIC_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC2_I2CT_IPSPECIFIC */

/** @addtogroup M33C1SPGSS0_UC2_I2CT_IPSTANDARD_DMA_TRIG0
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00045088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00045090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00045098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000450A0) Interrupt set */
} M33C1SPGSS0_UC2_I2CT_IPSTANDARD_DMA_TRIG0_Regs;

