TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/** @addtogroup M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00003088) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00003090) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00003098) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000030A0) Interrupt set */
} M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX */

/** @addtogroup M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX
  @{
*/

typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00003058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00003060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00003068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00003070) Interrupt set */
} M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX */

/** @addtogroup M33C1SPGSS0_UC1_UART_IPSTANDARD_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00003020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00003028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00003030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00003038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00003040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00003048) Interrupt clear */
} M33C1SPGSS0_UC1_UART_IPSTANDARD_CPU_INT_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC1_UART_IPSTANDARD_CPU_INT */

/** @addtogroup M33C1SPGSS0_UC1_UART_IPSTANDARD
  @{
*/

typedef struct {
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00003000) Clock Divider */
       uint32_t RESERVED0;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00003008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED1[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00003018) Peripheral Debug Control */
       uint32_t RESERVED2;
  M33C1SPGSS0_UC1_UART_IPSTANDARD_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00003020) */
       uint32_t RESERVED3;
  M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_Regs  DMA_TRIG_RX;                       /* !< (@ 0x00003050) */
       uint32_t RESERVED4[3];
  M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_Regs  DMA_TRIG_TX;                       /* !< (@ 0x00003080) */
       uint32_t RESERVED5[16];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000030E4) Interrupt control register */
} M33C1SPGSS0_UC1_UART_IPSTANDARD_Regs;

/*@}*/ /* end of group M33C1SPGSS0_UC1_UART_IPSTANDARD */

/** @addtogroup M33C1SPGSS0_FUPDATE
  @{
*/

typedef struct {
  union {
      __O  uint32_t U1_SCL_RX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U1_SCL_RX_STAT_IO0;                /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_SDA_TX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U1_SDA_TX_STAT_IO1;                /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_RTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U1_RTS_STAT_IO2;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U1_CTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U1_CTS_STAT_IO3;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_SCL_RX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U2_SCL_RX_STAT_IO4;                /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_SDA_TX;                         /* !< FUPDATE version of P0 */
      __I  uint32_t U2_SDA_TX_STAT_IO5;                /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_RTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U2_RTS_STAT_IO6;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
  union {
      __O  uint32_t U2_CTS;                            /* !< FUPDATE version of P0 */
      __I  uint32_t U2_CTS_STAT_IO7;                   /* !< A read to the F Update Only region will return the associated pad
                                                      number (1..255) and a status of whether the pad has its WAKEUP
                                                      asserted.  The WAKEUP status allows the application to determine if
                                                      this pad caused Wake From Shutdown. When read from an IP Instance
                                                      Region the WAKEUP status will be specific to this instance port
                                                      pin.  When read from the UNASGN memory region this will only
                                                      provide the direct  IOPAD WAKEUP status. */
  };
} M33C1SPGSS0_FUPDATE_Regs;

