TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/*@}*/ /* end of group M33C1SPGSS0_FUPDATE */

/** @addtogroup M33C1SPGSS0_PINCM
  @{
*/

typedef struct {
  __IO uint32_t U1_SCL_RX;                         /* !< (@ 0x00000004) P0 */
  __IO uint32_t U1_SDA_TX;                         /* !< (@ 0x00000008) P0 */
  __IO uint32_t U1_RTS;                            /* !< (@ 0x0000000C) P0 */
  __IO uint32_t U1_CTS;                            /* !< (@ 0x00000010) P0 */
  __IO uint32_t U2_SCL_RX;                         /* !< (@ 0x00000014) P0 */
  __IO uint32_t U2_SDA_TX;                         /* !< (@ 0x00000018) P0 */
  __IO uint32_t U2_RTS;                            /* !< (@ 0x0000001C) P0 */
  __IO uint32_t U2_CTS;                            /* !< (@ 0x00000020) P0 */
} M33C1SPGSS0_PINCM_Regs;

/*@}*/ /* end of group M33C1SPGSS0_PINCM */

/** @addtogroup M33C1SPGSS0
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  M33C1SPGSS0_PINCM_Regs  PINCM;                             /* !< (@ 0x00000004) */
       uint32_t RESERVED1[120];
  M33C1SPGSS0_FUPDATE_Regs  FUPDATE;                           /* !< (@ 0x00000204) */
       uint32_t RESERVED2[2935];
  M33C1SPGSS0_UC1_UART_IPSTANDARD_Regs  UC1_UART_IPSTANDARD;               /* !< (@ 0x00003000) */
       uint32_t RESERVED3[6];
  M33C1SPGSS0_UC1_UART_IPSPECIFIC_Regs  UC1_UART_IPSPECIFIC;               /* !< (@ 0x00003100) */
       uint32_t RESERVED4[812];
  M33C1SPGSS0_UC1_UART_LMGMT_DFT_ATRT_Regs  UC1_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00003E00) */
       uint32_t RESERVED5[1151];
  M33C1SPGSS0_UC2_UART_IPSTANDARD_Regs  UC2_UART_IPSTANDARD;               /* !< (@ 0x00005000) */
       uint32_t RESERVED6[6];
  M33C1SPGSS0_UC2_UART_IPSPECIFIC_Regs  UC2_UART_IPSPECIFIC;               /* !< (@ 0x00005100) */
       uint32_t RESERVED7[812];
  M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_Regs  UC2_UART_LMGMT_DFT_ATRT;           /* !< (@ 0x00005E00) */
       uint32_t RESERVED8[29823];
  M33C1SPGSS0_UC1_I2CC_IPSTANDARD_Regs  UC1_I2CC_IPSTANDARD;               /* !< (@ 0x00023000) */
       uint32_t RESERVED9[6];
  M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_Regs  UC1_I2CC_IPSPECIFIC;               /* !< (@ 0x00023100) */
       uint32_t RESERVED10[809];
  M33C1SPGSS0_UC1_I2CC_LMGMT_DFT_ATRT_Regs  UC1_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00023E00) */
       uint32_t RESERVED11[1150];
  M33C1SPGSS0_UC2_I2CC_IPSTANDARD_Regs  UC2_I2CC_IPSTANDARD;               /* !< (@ 0x00025000) */
       uint32_t RESERVED12[6];
  M33C1SPGSS0_UC2_I2CC_IPSPECIFIC_Regs  UC2_I2CC_IPSPECIFIC;               /* !< (@ 0x00025100) */
       uint32_t RESERVED13[809];
  M33C1SPGSS0_UC2_I2CC_LMGMT_DFT_ATRT_Regs  UC2_I2CC_LMGMT_DFT_ATRT;           /* !< (@ 0x00025E00) */
       uint32_t RESERVED14[29822];
  M33C1SPGSS0_UC1_I2CT_IPSTANDARD_Regs  UC1_I2CT_IPSTANDARD;               /* !< (@ 0x00043000) */
       uint32_t RESERVED15[6];
  M33C1SPGSS0_UC1_I2CT_IPSPECIFIC_Regs  UC1_I2CT_IPSPECIFIC;               /* !< (@ 0x00043100) */
       uint32_t RESERVED16[809];
  M33C1SPGSS0_UC1_I2CT_LMGMT_DFT_ATRT_Regs  UC1_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00043E00) */
       uint32_t RESERVED17[1150];
  M33C1SPGSS0_UC2_I2CT_IPSTANDARD_Regs  UC2_I2CT_IPSTANDARD;               /* !< (@ 0x00045000) */
       uint32_t RESERVED18[6];
  M33C1SPGSS0_UC2_I2CT_IPSPECIFIC_Regs  UC2_I2CT_IPSPECIFIC;               /* !< (@ 0x00045100) */
       uint32_t RESERVED19[809];
  M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_Regs  UC2_I2CT_LMGMT_DFT_ATRT;           /* !< (@ 0x00045E00) */
       uint32_t RESERVED20[62078];
  M33C1SPGSS0_EXT_GPRCM_UC1_Regs  EXT_GPRCM_UC1;                     /* !< (@ 0x00082800) */
       uint32_t RESERVED21[570];
  M33C1SPGSS0_UC1_IPSPECIFIC_Regs  UC1_IPSPECIFIC;                    /* !< (@ 0x00083100) */
       uint32_t RESERVED22[1471];
  M33C1SPGSS0_EXT_GPRCM_UC2_Regs  EXT_GPRCM_UC2;                     /* !< (@ 0x00084800) */
       uint32_t RESERVED23[570];
  M33C1SPGSS0_UC2_IPSPECIFIC_Regs  UC2_IPSPECIFIC;                    /* !< (@ 0x00085100) */
       uint32_t RESERVED24[27647];
  M33C1SPGSS0_SPGSS_IPSPECIFIC_Regs  SPGSS_IPSPECIFIC;                  /* !< (@ 0x000A0100) */
       uint32_t RESERVED25[655];
  M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_Regs  SPGSS_LMGMT_DFT_ATRT;              /* !< (@ 0x000A0C00) */
} M33C1SPGSS0_Regs;

/*@}*/ /* end of group M33C1SPGSS0 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* SPGSS0 Register Control Bits
******************************************************************************/

/* M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS0_SPGSS_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000000FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */

/* M33C1SPGSS0_PAIR0 Bits */
/* M33C1SPGSS0_PAIR0[CTL] Bits */
#define M33C1SPGSS0_PAIR0_CTL_OFS                (8)                             /* !< CTL Offset */
#define M33C1SPGSS0_PAIR0_CTL_MASK               ((uint32_t)0x00000F00U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    controller. */
#define M33C1SPGSS0_PAIR0_CTL_SPG1               ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG2               ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG3               ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG4               ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG5               ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG6               ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG7               ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG8               ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG9               ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG10              ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG11              ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG12              ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG13              ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG14              ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG15              ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_PAIR0_CTL_SPG16              ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS0_PAIR0[TARGET] Bits */
#define M33C1SPGSS0_PAIR0_TARGET_OFS             (12)                            /* !< TARGET Offset */
#define M33C1SPGSS0_PAIR0_TARGET_MASK            ((uint32_t)0x0000F000U)         /* !< UNICOMM instance for loopback. This
                                                                                    instance will be treated as the
                                                                                    target */
#define M33C1SPGSS0_PAIR0_TARGET_SPG1            ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG2            ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG3            ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG4            ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG5            ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG6            ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG7            ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG8            ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG9            ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG10           ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG11           ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG12           ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG13           ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG14           ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG15           ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_PAIR0_TARGET_SPG16           ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */
/* M33C1SPGSS0_PAIR0[EN] Bits */
#define M33C1SPGSS0_PAIR0_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS0_PAIR0_EN_MASK                ((uint32_t)0x00000001U)         /* !< Enable */
#define M33C1SPGSS0_PAIR0_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_PAIR0_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */

