TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_LPBK0 Bits */
/* M33C1SPGSS0_LPBK0[CONTROLLER] Bits */
#define M33C1SPGSS0_LPBK0_CONTROLLER_OFS         (8)                             /* !< CONTROLLER Offset */
#define M33C1SPGSS0_LPBK0_CONTROLLER_MASK        ((uint32_t)0x00000F00U)         /* !< Select SPG controller for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG1        ((uint32_t)0x00000000U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG2        ((uint32_t)0x00000100U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG3        ((uint32_t)0x00000200U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG4        ((uint32_t)0x00000300U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG5        ((uint32_t)0x00000400U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG6        ((uint32_t)0x00000500U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG7        ((uint32_t)0x00000600U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG8        ((uint32_t)0x00000700U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG9        ((uint32_t)0x00000800U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG10       ((uint32_t)0x00000900U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG11       ((uint32_t)0x00000A00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG12       ((uint32_t)0x00000B00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG13       ((uint32_t)0x00000C00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG14       ((uint32_t)0x00000D00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG15       ((uint32_t)0x00000E00U)         /* !< SPG commander select for loopback. */
#define M33C1SPGSS0_LPBK0_CONTROLLER_SPG16       ((uint32_t)0x00000F00U)         /* !< SPG commander select for loopback. */
/* M33C1SPGSS0_LPBK0[EN] Bits */
#define M33C1SPGSS0_LPBK0_EN_OFS                 (0)                             /* !< EN Offset */
#define M33C1SPGSS0_LPBK0_EN_MASK                ((uint32_t)0x00000001U)         /* !< Loopback  enable */
#define M33C1SPGSS0_LPBK0_EN_DISABLE             ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_LPBK0_EN_ENABLE              ((uint32_t)0x00000001U)         /* !< Select this clock as a source */
/* M33C1SPGSS0_LPBK0[PERIPHERAL] Bits */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_OFS         (12)                            /* !< PERIPHERAL Offset */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_MASK        ((uint32_t)0x0000F000U)         /* !< Select SPG peripheral for loopback.
                                                                                    Signals invovled in loopback based
                                                                                    on interface chosen 1. SPI : CS,
                                                                                    SCLK, SDI, SDO  2. I2C : SCL, SDA 3.
                                                                                    UART : TX, RX */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG1        ((uint32_t)0x00000000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG2        ((uint32_t)0x00001000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG3        ((uint32_t)0x00002000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG4        ((uint32_t)0x00003000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG5        ((uint32_t)0x00004000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG6        ((uint32_t)0x00005000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG7        ((uint32_t)0x00006000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG8        ((uint32_t)0x00007000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG9        ((uint32_t)0x00008000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG10       ((uint32_t)0x00009000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG11       ((uint32_t)0x0000A000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG12       ((uint32_t)0x0000B000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG13       ((uint32_t)0x0000C000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG14       ((uint32_t)0x0000D000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG15       ((uint32_t)0x0000E000U)         /* !< SPG responder select for loopback. */
#define M33C1SPGSS0_LPBK0_PERIPHERAL_SPG16       ((uint32_t)0x0000F000U)         /* !< SPG responder select for loopback. */

