TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_EXT_GPRCM_UC1_PWREN Bits */
/* M33C1SPGSS0_EXT_GPRCM_UC1_PWREN[ENABLE] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_ENABLE_OFS (0)                             /* !< ENABLE Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_ENABLE_MASK ((uint32_t)0x00000001U)         /* !< Enable the power */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_ENABLE_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Power */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_ENABLE_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Power */
/* M33C1SPGSS0_EXT_GPRCM_UC1_PWREN[KEY] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_KEY_OFS  (24)                            /* !< KEY Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define M33C1SPGSS0_EXT_GPRCM_UC1_PWREN_KEY_UNLOCK_W ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL Bits */
/* M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL[RESETSTKYCLR] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETSTKYCLR_OFS (1)                             /* !< RESETSTKYCLR Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETSTKYCLR_MASK ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETSTKYCLR_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETSTKYCLR_CLR ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL[RESETASSERT] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETASSERT_OFS (0)                             /* !< RESETASSERT Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETASSERT_MASK ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETASSERT_NOP ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_RESETASSERT_ASSERT ((uint32_t)0x00000001U)         /* !< Assert reset */
/* M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL[KEY] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_KEY_MASK ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define M33C1SPGSS0_EXT_GPRCM_UC1_RSTCTL_KEY_UNLOCK_W ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG Bits */
/* M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG[KEY] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_KEY_OFS (24)                            /* !< KEY Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_KEY_MASK ((uint32_t)0xFF000000U)         /* !< KEY to Allow State Change -- 0xA9 */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_KEY_UNLOCK ((uint32_t)0xA9000000U)         /* !< key value to allow change field of
                                                                                    GPRCM */
/* M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG[BLOCKASYNC] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_BLOCKASYNC_OFS (8)                             /* !< BLOCKASYNC Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_BLOCKASYNC_MASK ((uint32_t)0x00000100U)         /* !< Async Clock Request is blocked from
                                                                                    starting SYSOSC or forcing bus clock
                                                                                    to 32MHz */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_BLOCKASYNC_DISABLE ((uint32_t)0x00000000U)         /* !< Not block async clock request */
#define M33C1SPGSS0_EXT_GPRCM_UC1_CLKCFG_BLOCKASYNC_ENABLE ((uint32_t)0x00000100U)         /* !< Block async clock request */

/* M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT Bits */
/* M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT[RESETSTKY] Bits */
#define M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT_RESETSTKY_OFS (16)                            /* !< RESETSTKY Offset */
#define M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT_RESETSTKY_MASK ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT_RESETSTKY_NORES ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define M33C1SPGSS0_EXT_GPRCM_UC1_GPRCM_STAT_RESETSTKY_RESET ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1 Bits */
/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1[SCL_TRIM_EN] Bits */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_OFS (0)                             /* !< SCL_TRIM_EN Offset */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_MASK ((uint32_t)0x00000001U)         /* !< Analog glitch filter trimming
                                                                                    enable for SCL */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SCL */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SCL_TRIM_EN_ENABLE ((uint32_t)0x00000001U)         /* !< Enable Trim for SCL */
/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1[SDA_TRIM_EN] Bits */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_OFS (1)                             /* !< SDA_TRIM_EN Offset */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_MASK ((uint32_t)0x00000002U)         /* !< Analog glitch filter trimming
                                                                                    enable for SDA */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Trim for SDA */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_SDA_TRIM_EN_ENABLE ((uint32_t)0x00000002U)         /* !< Enable Trim for SDA */
/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1[TRIM_SEL] Bits */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_OFS (2)                             /* !< TRIM_SEL Offset */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_MASK ((uint32_t)0x00000004U)         /* !< Select for which branch to trim */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_FALLING_EDGE ((uint32_t)0x00000000U)         /* !< Select Trim on falling edge */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_TRIM_SEL_RISING_EDGE ((uint32_t)0x00000004U)         /* !< Select Trim on rising edge */
/* M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1[AGFTEST] Bits */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_AGFTEST_OFS (8)                             /* !< AGFTEST Offset */
#define M33C1SPGSS0_UC2_I2CT_LMGMT_DFT_ATRT_TEST1_AGFTEST_MASK ((uint32_t)0x00000100U)

