TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS Bits */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXDONE] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXDONE] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[GENCALL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_GENCALL_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[START] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_MASK ((uint32_t)0x00000200U)         /* !< START Detection Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_START_SET ((uint32_t)0x00000200U)         /* !< Set MIS */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[STOP] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_MASK ((uint32_t)0x00000400U)         /* !< STOP Detection Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_STOP_SET ((uint32_t)0x00000400U)         /* !< Set MIS */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[DMA_DONE_TX] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set MIS */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[DMA_DONE_RX] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_CLR ((uint32_t)0x00000000U)         /* !< Clear MIS */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set MIS */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[PEC_RX_ERR] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< Target RX Pec Error Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set interrupt mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TIMEOUTA] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TIMEOUTB] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Set interrupt mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RXFULL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TXEMPTY] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[TX_UNFL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_TX_UNFL_SET ((uint32_t)0x00000040U)         /* !< Set interrupt mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[RX_OVFL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_CLR ((uint32_t)0x00000000U)         /* !< Clear interrupt mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_RX_OVFL_SET ((uint32_t)0x00000080U)         /* !< Set interrupt mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS[ARBLOST] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_OFS (17)                            /* !< ARBLOST Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_MASK ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_MIS_ARBLOST_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET Bits */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[RXDONE] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Target Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXDONE_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TXDONE] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Target Transmit Transaction
                                                                                    completed Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXDONE_SET ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[GENCALL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_GENCALL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_GENCALL_SET ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[START] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_START_MASK ((uint32_t)0x00000200U)         /* !< Start Condition Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_START_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_START_SET ((uint32_t)0x00000200U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[STOP] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_STOP_MASK ((uint32_t)0x00000400U)         /* !< Stop Condition Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_STOP_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_STOP_SET ((uint32_t)0x00000400U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[PEC_RX_ERR] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< Target RX Pec Error Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_PEC_RX_ERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_PEC_RX_ERR_SET ((uint32_t)0x00000800U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TIMEOUTA] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTA_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTA_SET ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TIMEOUTB] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTB_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TIMEOUTB_SET ((uint32_t)0x00002000U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[RXFULL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RXFULL_SET ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TXEMPTY] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TXEMPTY_SET ((uint32_t)0x00000020U)         /* !< Set Interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[TX_UNFL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TX_UNFL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_TX_UNFL_SET ((uint32_t)0x00000040U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[RX_OVFL] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RX_OVFL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_RX_OVFL_SET ((uint32_t)0x00000080U)         /* !< Set interrupt */
/* M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET[ARBLOST] Bits */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_ARBLOST_OFS (17)                            /* !< ARBLOST Offset */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_ARBLOST_MASK ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_ARBLOST_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC2_I2CT_IPSTANDARD_CPU_INT_ISET_ARBLOST_SET ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

