TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[RXDONE] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXDONE_OFS (0)                             /* !< RXDONE Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXDONE_MASK ((uint32_t)0x00000001U)         /* !< Target Receive Data Interrupt
                                                                                    Signals that a byte has been received */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXDONE_CLR ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TXDONE] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXDONE_OFS (1)                             /* !< TXDONE Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXDONE_MASK ((uint32_t)0x00000002U)         /* !< Target Transmit Transaction
                                                                                    completed Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXDONE_CLR ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[GENCALL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_GENCALL_OFS (8)                             /* !< GENCALL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_GENCALL_MASK ((uint32_t)0x00000100U)         /* !< General Call Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_GENCALL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_GENCALL_CLR ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[RXTRG] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXTRG_CLR ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TXTRG] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXTRG_CLR ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[START] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_START_OFS (9)                             /* !< START Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_START_MASK ((uint32_t)0x00000200U)         /* !< Target START Detection Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_START_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_START_CLR ((uint32_t)0x00000200U)         /* !< Clear interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[STOP] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_STOP_OFS (10)                            /* !< STOP Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_STOP_MASK ((uint32_t)0x00000400U)         /* !< Target STOP Detection Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_STOP_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_STOP_CLR ((uint32_t)0x00000400U)         /* !< Clear interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Clear interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Clear interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[PEC_RX_ERR] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_PEC_RX_ERR_OFS (11)                            /* !< PEC_RX_ERR Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< Target RX Pec Error Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_PEC_RX_ERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_PEC_RX_ERR_CLR ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TIMEOUTA] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTA_OFS (12)                            /* !< TIMEOUTA Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTA_MASK ((uint32_t)0x00001000U)         /* !< Timeout A interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTA_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTA_CLR ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TIMEOUTB] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTB_OFS (13)                            /* !< TIMEOUTB Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTB_MASK ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTB_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TIMEOUTB_CLR ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[RXFULL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXFULL_OFS (4)                             /* !< RXFULL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXFULL_MASK ((uint32_t)0x00000010U)         /* !< RXFIFO full event. This interrupt
                                                                                    is set if an RX FIFO is full. */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RXFULL_CLR ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TXEMPTY] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXEMPTY_OFS (5)                             /* !< TXEMPTY Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXEMPTY_MASK ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TXEMPTY_CLR ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[TX_UNFL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TX_UNFL_OFS (6)                             /* !< TX_UNFL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TX_UNFL_MASK ((uint32_t)0x00000040U)         /* !< Target TX FIFO underflow */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TX_UNFL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_TX_UNFL_CLR ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[RX_OVFL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RX_OVFL_OFS (7)                             /* !< RX_OVFL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RX_OVFL_MASK ((uint32_t)0x00000080U)         /* !< Target RX FIFO overflow */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RX_OVFL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_RX_OVFL_CLR ((uint32_t)0x00000080U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR[ARBLOST] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_ARBLOST_OFS (17)                            /* !< ARBLOST Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_ARBLOST_MASK ((uint32_t)0x00020000U)         /* !< Arbitration Lost Interrupt */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_ARBLOST_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_ICLR_ARBLOST_CLR ((uint32_t)0x00020000U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL[MFCLK_SEL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_MFCLK_SEL_OFS (2)                             /* !< MFCLK_SEL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_MFCLK_SEL_MASK ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_MFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_MFCLK_SEL_ENABLE ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_UC1_I2CT_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

