TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS[TXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET[TXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG0_ISET_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_IMASK_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger 				    When FIFO
                                                                                    is present, trigger when RX FIFO
                                                                                    contains >= defined bytes
                                                                                    when FIFO is not present, this
                                                                                    indicates when buffer is full */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_RIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_MIS_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET[RXTRG] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_OFS (2)                             /* !< RXTRG Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_MASK ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_DMA_TRIG1_ISET_RXTRG_SET ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< I2C Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_RXDONEFG ((uint32_t)0x00000001U)         /* !< Data received */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_TXDONEFG ((uint32_t)0x00000002U)         /* !< data transmitted */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_RXTRG ((uint32_t)0x00000003U)         /* !< Receive Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_TXTRG ((uint32_t)0x00000004U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_RXFULL ((uint32_t)0x00000005U)         /* !< RX FIFO FULL Event/interrupt
                                                                                    pending */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_TXEMPTY ((uint32_t)0x00000006U)         /* !< Transmit FIFO/Buffer Empty
                                                                                    Event/interrupt pending */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_NACKFG ((uint32_t)0x00000008U)         /* !< Address/Data NACK */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_STARTFG ((uint32_t)0x00000009U)         /* !< Start Event */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_STOPFG ((uint32_t)0x0000000AU)         /* !< Stop Event */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_ARBLOSTFG ((uint32_t)0x0000000BU)         /* !< Arbitration Lost */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_PEC_RX_ERR ((uint32_t)0x0000000CU)         /* !< PEC Receive Error Event */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_TIMEOUTA ((uint32_t)0x0000000DU)         /* !< Timeout A Event */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_TIMEOUTB ((uint32_t)0x0000000EU)         /* !< Timeout B Event */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on Channel RX */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on Channel TX */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS0_UC2_I2CC_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

