TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR[TPR] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR_TPR_OFS (0)                             /* !< TPR Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR_TPR_MASK ((uint32_t)0x0000007FU)         /* !< Timer Period  This field is used in
                                                                                    the equation to configure SCL_PERIOD
                                                                                    : SCL_PERIOD = (1 + TPR ) * (SCL_LP +
                                                                                    SCL_HP ) * INT_CLK_PRD where:
                                                                                    SCL_PRD is the SCL line period (I2C
                                                                                    clock).   TPR is the Timer Period
                                                                                    register value (range of 1 to 127).
                                                                                    SCL_LP is the SCL Low period (fixed
                                                                                    at 6).   SCL_HP is the SCL High
                                                                                    period (fixed at 4).   CLK_PRD is the
                                                                                    functional clock period in ns. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR_TPR_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TPR_TPR_MAXIMUM ((uint32_t)0x0000007FU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL[AGFEN] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL_AGFEN_OFS (8)                             /* !< AGFEN Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL_AGFEN_MASK ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL_AGFEN_DISABLE ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_GFCTL_AGFEN_ENABLE ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON[SCL] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SCL_OFS (0)                             /* !< SCL Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SCL_MASK ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SCL_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SCL_SET ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON[SDA] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SDA_OFS (1)                             /* !< SDA Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SDA_MASK ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SDA_CLEARED ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_BMON_SDA_SET ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA[DATA] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA[DATA] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA_DATA_MASK ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_RXDATA_DATA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

