TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTA] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_OFS (0)                             /* !< TCNTA Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout Count A Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter A */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT[TCNTB] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_OFS (16)                            /* !< TCNTB Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MASK ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Current Count: This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit current counter for timeout
                                                                                    counter B */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CNT_TCNTB_MAXIMUM ((uint32_t)0x00FF0000U)         /* !< Highest possible value */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLA] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_OFS (0)                             /* !< TCNTLA Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MASK ((uint32_t)0x000000FFU)         /* !< Timeout counter A load value
                                                                                    Counter A is used for SCL low
                                                                                    detection. This field contains the
                                                                                    upper 8 bits of a 12-bit pre-load
                                                                                    value for the Timeout A count. NOTE:
                                                                                    The value of CNTLA must be greater
                                                                                    than 1h.  Each count is equal to 520
                                                                                    times the timeout period of
                                                                                    functional clock. For example, with
                                                                                    8MHz functional clock and a 100KHz
                                                                                    operating I2C clock, one timeout
                                                                                    period will be equal to (1 / 8MHz) *
                                                                                    520 or 65 us. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest Value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLA_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTAEN] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_OFS (15)                            /* !< TCNTAEN Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_MASK ((uint32_t)0x00008000U)         /* !< Timeout Counter A Enable */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTAEN_ENABLE ((uint32_t)0x00008000U)         /* !< Enable Timeout Counter B */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTLB] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_OFS (16)                            /* !< TCNTLB Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MASK ((uint32_t)0x00FF0000U)         /* !< Timeout Count B Load: Counter B is
                                                                                    used for SCL High Detection. This
                                                                                    field contains the upper 8 bits of a
                                                                                    12-bit pre-load value for the Timeout
                                                                                    B count. NOTE: The value of CNTLB
                                                                                    must be greater than 1h.  Each count
                                                                                    is equal to 1* clock period. For
                                                                                    example, with 10MHz functional clock
                                                                                    one timeout period will be equal
                                                                                    to1*100ns. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest possible value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTLB_MAXIMUM ((uint32_t)0x00FF0000U)         /* !< Highest possible value */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL[TCNTBEN] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_OFS (31)                            /* !< TCNTBEN Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_MASK ((uint32_t)0x80000000U)         /* !< Timeout Counter B Enable */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Timeout Counter B */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_TIMEOUT_CTL_TCNTBEN_ENABLE ((uint32_t)0x80000000U)         /* !< Enable Timeout Counter B */

/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL[PECCNT] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECCNT_OFS (0)                             /* !< PECCNT Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECCNT_MASK ((uint32_t)0x000001FFU)         /* !< PEC Count When this field is non
                                                                                    zero, the number of I2C bytes are
                                                                                    counted (Note that although the PEC
                                                                                    is calculated on the I2C address it
                                                                                    is not counted at a byte). When the
                                                                                    byte count = PECCNT and the state
                                                                                    machine is transmitting, the contents
                                                                                    of the LSFR is loaded into the shift
                                                                                    register instead of the byte received
                                                                                    from the Tx FIFO. When the state
                                                                                    machine is receiving, after the last
                                                                                    bit of this byte is received the LSFR
                                                                                    is checked and if it is non-zero, a
                                                                                    PEC RX Error interrupt is generated.
                                                                                    The I2C packet must be padded to
                                                                                    include the PEC byte for both
                                                                                    transmit and receive. In transmit
                                                                                    mode the FIFO must be loaded with a
                                                                                    dummy PEC byte. In receive mode the
                                                                                    PEC byte will be passed to the Rx
                                                                                    FIFO. In the normal Controller use
                                                                                    case, FW would set PECEN=1 and
                                                                                    PECCNT=SMB packet length (Not
                                                                                    including Target Address byte, but
                                                                                    including the PEC byte). FW would
                                                                                    then configure DMA to allow the
                                                                                    packet to complete unassisted and
                                                                                    write MCTR to initiate the
                                                                                    transaction. Note that when the byte
                                                                                    count = PEC CNT, the byte count is
                                                                                    reset to 0 and multiple PEC
                                                                                    calculation can automatically occur
                                                                                    within a single I2C transaction. Note
                                                                                    that any write to the I2PECCTL
                                                                                    Register will clear the current PEC
                                                                                    Byte Count in the State Machine. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECCNT_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum Value */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECCNT_MAXIMUM ((uint32_t)0x000001FFU)         /* !< Maximum Value */
/* M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL[PECEN] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECEN_OFS (12)                            /* !< PECEN Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECEN_MASK ((uint32_t)0x00001000U)         /* !< PEC Enable This bit enables the SMB
                                                                                    Packet Error Checking (PEC). When
                                                                                    enabled the PEC is calculated on all
                                                                                    bits except the Start, Stop, Ack and
                                                                                    Nack. The PEC LSFR and the Byte
                                                                                    Counter is set to 0 when the State
                                                                                    Machine is in the IDLE state, which
                                                                                    occur following a Stop or when a
                                                                                    timeout occurs. The Counter is also
                                                                                    set to 0 after the PEC byte is sent
                                                                                    or received. Note that the NACK is
                                                                                    automatically send following a PEC
                                                                                    byte that results in a PEC error. The
                                                                                    PEC Polynomial is x^8 + x^2 + x^1 +
                                                                                    1. */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECEN_DISABLE ((uint32_t)0x00000000U)         /* !< PEC is disabled */
#define M33C1SPGSS0_UC1_I2CC_IPSPECIFIC_PECCTL_PECEN_ENABLE ((uint32_t)0x00001000U)         /* !< PEC is enabled */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK[TXTRG] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_IMASK_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS[TXTRG] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_RIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS[TXTRG] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_OFS (3)                             /* !< TXTRG Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_MASK ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_DMA_TRIG0_MIS_TXTRG_SET ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

