TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV[RATIO] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_OFS (0)                             /* !< RATIO Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_MASK ((uint32_t)0x00000007U)         /* !< Selects divide ratio of module
                                                                                    clock Division factor 0 : DIV_BY_1 1
                                                                                    : DIV_BY_2 .... 63: DIV_BY_64 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_1 ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_2 ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_3 ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_4 ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_5 ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_6 ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_7 ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_8 ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_61 ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_62 ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_63 ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKDIV_RATIO_DIV_BY_64 ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL[MFCLK_SEL] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_MFCLK_SEL_OFS (2)                             /* !< MFCLK_SEL Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_MFCLK_SEL_MASK ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_MFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_MFCLK_SEL_ENABLE ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL[BUSCLK_SEL] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_OFS (3)                             /* !< BUSCLK_SEL Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_MASK ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_CLKSEL_BUSCLK_SEL_ENABLE ((uint32_t)0x00000008U)         /* !< Select this clock as a source */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL[FREE] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_FREE_OFS (0)                             /* !< FREE Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_FREE_MASK ((uint32_t)0x00000001U)         /* !< Free run control */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_FREE_STOP ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_FREE_RUN ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL[SOFT] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_SOFT_OFS (1)                             /* !< SOFT Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_SOFT_MASK ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_SOFT_DEPRECATED ((uint32_t)0x00000000U)         /* !< Not supported */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_PDBGCTL_SOFT_DELAYED ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL Bits */
/* M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL[INTEVAL] Bits */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL_INTEVAL_OFS (0)                             /* !< INTEVAL Offset */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL_INTEVAL_MASK ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL_INTEVAL_DISABLE ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define M33C1SPGSS0_UC1_I2CC_IPSTANDARD_INTCTL_INTEVAL_EVAL ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0 Bits */
/* M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0[DTB_MUX_SEL] Bits */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_OFS (0)                             /* !< DTB_MUX_SEL Offset */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_MASK ((uint32_t)0x0000001FU)         /* !< This bit field is used to select
                                                                                    DTB mux digital output signals. */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Disables DTB MUX */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP1 ((uint32_t)0x00000001U)         /* !< Selects test group 1 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP2 ((uint32_t)0x00000002U)         /* !< Selects test group 2 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP3 ((uint32_t)0x00000003U)         /* !< Selects test group 3 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP4 ((uint32_t)0x00000004U)         /* !< Selects test group 4 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP5 ((uint32_t)0x00000005U)         /* !< Selects test group 5 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP6 ((uint32_t)0x00000006U)         /* !< Selects test group 6 */
#define M33C1SPGSS0_UC2_UART_LMGMT_DFT_ATRT_TEST0_DTB_MUX_SEL_GRP7 ((uint32_t)0x00000007U)         /* !< Selects test group 7 */

