TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[BRK] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_BRK_OFS (0)                             /* !< BRK Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_BRK_MASK ((uint32_t)0x00000001U)         /* !< UART Send Break (for LIN Protocol)
                                                                                    1. Break condition is sent on the
                                                                                    line for as long as this bit is set */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_BRK_DISABLE ((uint32_t)0x00000000U)         /* !< Normal operation */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_BRK_ENABLE ((uint32_t)0x00000001U)         /* !< A low level is continually output
                                                                                    on the UARTxTXD signal, after
                                                                                    completing transmission of the
                                                                                    current character. For the proper
                                                                                    execution of the break command,
                                                                                    software must set this bit for at
                                                                                    least two frames (character periods). */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[PEN] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_PEN_OFS (1)                             /* !< PEN Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_PEN_MASK ((uint32_t)0x00000002U)         /* !< UART Parity Enable */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_PEN_DISABLE ((uint32_t)0x00000000U)         /* !< Parity is disabled and no parity
                                                                                    bit is added to the data frame. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_PEN_ENABLE ((uint32_t)0x00000002U)         /* !< Parity checking and generation is
                                                                                    enabled. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[EPS] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EPS_OFS (2)                             /* !< EPS Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EPS_MASK ((uint32_t)0x00000004U)         /* !< UART Even Parity Select  This bit
                                                                                    has no effect when parity is disabled
                                                                                    by the PEN bit.  For 9-Bit UART Mode
                                                                                    transmissions, this bit controls the
                                                                                    address byte and data byte indication
                                                                                    (9th bit). 0 = The transferred byte
                                                                                    is a data byte 1 = The transferred
                                                                                    byte is an address byte */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EPS_ODD ((uint32_t)0x00000000U)         /* !< Odd parity is performed, which
                                                                                    checks for an odd number of 1s. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EPS_EVEN ((uint32_t)0x00000004U)         /* !< Even parity generation and checking
                                                                                    is performed during transmission and
                                                                                    reception, which checks for an even
                                                                                    number of 1s in data and parity bits. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[STP2] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_STP2_OFS (3)                             /* !< STP2 Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_STP2_MASK ((uint32_t)0x00000008U)         /* !< UART Two Stop Bits Select     When
                                                                                    in 7816 smart card mode (the SMART
                                                                                    bit is set in the UARTCTL register),
                                                                                    the number of stop bits is forced to
                                                                                    2. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_STP2_DISABLE ((uint32_t)0x00000000U)         /* !< One stop bit is transmitted at the
                                                                                    end of a frame. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_STP2_ENABLE ((uint32_t)0x00000008U)         /* !< Two stop bits are transmitted at
                                                                                    the end of a frame. The receive logic
                                                                                    checks for two stop bits being
                                                                                    received and provide Frame Error if
                                                                                    either is invalid. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[WLEN] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_OFS (4)                             /* !< WLEN Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_MASK ((uint32_t)0x00000030U)         /* !< UART Word Length  The bits indicate
                                                                                    the number of data bits transmitted
                                                                                    or received in a frame as follows: */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_DATABIT5 ((uint32_t)0x00000000U)         /* !< 5 bits (default) */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_DATABIT6 ((uint32_t)0x00000010U)         /* !< 6 bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_DATABIT7 ((uint32_t)0x00000020U)         /* !< 7 bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_WLEN_DATABIT8 ((uint32_t)0x00000030U)         /* !< 8 bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[SPS] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SPS_OFS (6)                             /* !< SPS Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SPS_MASK ((uint32_t)0x00000040U)         /* !< UART Stick Parity Select The Stick
                                                                                    Parity Select (SPS) bit is used to
                                                                                    set either a permanent '1' or a
                                                                                    permanent '0' as parity when
                                                                                    transmitting or receiving data. Its
                                                                                    purpose is to typically indicate the
                                                                                    first byte of a package or to mark an
                                                                                    address byte, for example in a
                                                                                    multi-drop RS-485 network. When bits
                                                                                    PEN, EPS, and SPS of UARTLCRH are
                                                                                    set, the parity bit is transmitted
                                                                                    and checked as a 0.  When bits PEN
                                                                                    and SPS are set and EPS is cleared,
                                                                                    the parity bit is transmitted and
                                                                                    checked as a 1. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SPS_DISABLE ((uint32_t)0x00000000U)         /* !< Disable Stick Parity */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SPS_ENABLE ((uint32_t)0x00000040U)         /* !< Enable Stick Parity */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[SENDIDLE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SENDIDLE_OFS (7)                             /* !< SENDIDLE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SENDIDLE_MASK ((uint32_t)0x00000080U)         /* !< UART send IDLE pattern. When this
                                                                                    bit is set,  SENDIDLE period of 11
                                                                                    bit times will be sent on the TX
                                                                                    line.   Read STAT.SENDIDLE bit to
                                                                                    readback current status of SENDIDLE */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SENDIDLE_DISABLE ((uint32_t)0x00000000U)         /* !< Normal operation */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SENDIDLE_ENABLE ((uint32_t)0x00000080U)         /* !< Send Idle Pattern */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[EXTDIR_SETUP] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_SETUP_OFS (16)                            /* !< EXTDIR_SETUP Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_SETUP_MASK ((uint32_t)0x001F0000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be set
                                                                                    before the START bit is send */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_SETUP_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_SETUP_MAXIMUM ((uint32_t)0x001F0000U)         /* !< Highest possible value */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[EXTDIR_HOLD] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_HOLD_OFS (21)                            /* !< EXTDIR_HOLD Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_HOLD_MASK ((uint32_t)0x03E00000U)         /* !< Defines the number of UARTclk ticks
                                                                                    the signal to control the external
                                                                                    driver for the RS485 will be reset
                                                                                    after the beginning of the stop bit.
                                                                                    (If 2 STOP bits are enabled the
                                                                                    beginning of the 2nd STOP bit.) */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_HOLD_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_EXTDIR_HOLD_MAXIMUM ((uint32_t)0x03E00000U)         /* !< Highest possible value */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH[SUSPEND] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SUSPEND_OFS (26)                            /* !< SUSPEND Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SUSPEND_MASK ((uint32_t)0x04000000U)         /* !< Suspend external communication */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SUSPEND_DISABLE ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LCRH_SUSPEND_ENABLE ((uint32_t)0x04000000U)         /* !< External communication suspended */

/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[BUSY] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_BUSY_OFS (0)                             /* !< BUSY Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_BUSY_MASK ((uint32_t)0x00000001U)         /* !< UART Busy 			This bit is set as
                                                                                    soon as the transmit FIFO/buffer
                                                                                    becomes non-empty (regardless of
                                                                                    whether UART is enabled) or if a
                                                                                    receive data is currently ongoing
                                                                                    (after the start edge have been
                                                                                    detected until a complete byte,
                                                                                    including all stop bits, has been
                                                                                    received by the shift register). In
                                                                                    IDLE_Line mode the Busy signal also
                                                                                    stays set during the idle time
                                                                                    generation. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_BUSY_CLEARED ((uint32_t)0x00000000U)         /* !< The UART is not busy. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_BUSY_SET ((uint32_t)0x00000001U)         /* !< The UART is busy transmitting data.
                                                                                    This bit remains set until the
                                                                                    complete byte, including all stop
                                                                                    bits, has been sent/received
                                                                                    from/into the shift register. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[TXFF] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFF_OFS (6)                             /* !< TXFF Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFF_MASK ((uint32_t)0x00000040U)         /* !< UART Transmit FIFO Full  The
                                                                                    meaning of this bit depends on the
                                                                                    state of the FEN bit in the CTL0
                                                                                    register. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter is not full. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFF_SET ((uint32_t)0x00000040U)         /* !< transmit FIFO is full. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[RXFF] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFF_OFS (3)                             /* !< RXFF Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFF_MASK ((uint32_t)0x00000008U)         /* !< UART Receive FIFO Full */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFF_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver can receive data. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFF_SET ((uint32_t)0x00000008U)         /* !< receive FIFO is full. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[TXFE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFE_OFS (5)                             /* !< TXFE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFE_MASK ((uint32_t)0x00000020U)         /* !< UART Transmit FIFO Empty */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The transmitter has data to
                                                                                    transmit. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXFE_SET ((uint32_t)0x00000020U)         /* !< transmit FIFO is empty. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[CTS] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_CTS_OFS (8)                             /* !< CTS Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_CTS_MASK ((uint32_t)0x00000100U)         /* !< Clear To Send */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_CTS_CLEARED ((uint32_t)0x00000000U)         /* !< The CTS signal is not asserted
                                                                                    (high). */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_CTS_SET ((uint32_t)0x00000100U)         /* !< The CTS signal is asserted (low). */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[IDLE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_IDLE_OFS (9)                             /* !< IDLE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_IDLE_MASK ((uint32_t)0x00000200U)         /* !< IDLE mode has been detected in
                                                                                    Idleline-Multiprocessor-Mode. The
                                                                                    IDLE bit is used as an address tag
                                                                                    for each block of characters. In
                                                                                    idle-line multiprocessor format, this
                                                                                    bit is set when a received character
                                                                                    is an address. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_IDLE_CLEARED ((uint32_t)0x00000000U)         /* !< IDLE has not been detected before
                                                                                    last received character. (In
                                                                                    idle-line multiprocessor mode). */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_IDLE_SET ((uint32_t)0x00000200U)         /* !< IDLE has been detected before last
                                                                                    received character. (In idle-line
                                                                                    multiprocessor mode). */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[RXFE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFE_OFS (2)                             /* !< RXFE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFE_MASK ((uint32_t)0x00000004U)         /* !< UART Receive FIFO Empty */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFE_CLEARED ((uint32_t)0x00000000U)         /* !< The receiver is not empty. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXFE_SET ((uint32_t)0x00000004U)         /* !< eceive FIFO is empty. */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[RXCLR] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXCLR_OFS (4)                             /* !< RXCLR Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXCLR_MASK ((uint32_t)0x00000010U)         /* !< RX FIFO Clear Status */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_RXCLR_SET ((uint32_t)0x00000010U)         /* !< FIFO clear is complete */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[TXCLR] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXCLR_OFS (7)                             /* !< TXCLR Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXCLR_MASK ((uint32_t)0x00000080U)         /* !< TX FIFO Clear Status */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXCLR_CLEARED ((uint32_t)0x00000000U)         /* !< FIFO is not cleared */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_TXCLR_SET ((uint32_t)0x00000080U)         /* !< FIFO clear is complete */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT[SENDIDLE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_SENDIDLE_OFS (10)                            /* !< SENDIDLE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_SENDIDLE_MASK ((uint32_t)0x00000400U)         /* !< TX FIFO Clear Status */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_SENDIDLE_CLEARED ((uint32_t)0x00000000U)         /* !< IDLE condition has not yet been
                                                                                    sent on the line */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_STAT_SENDIDLE_SET ((uint32_t)0x00000400U)         /* !< IDLE condition has been sent on the
                                                                                    line */

