TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0 Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0[DATA] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    falling edge and can generate a LINC0
                                                                                    interrupt when capture is enabled
                                                                                    (LINC0CAP = 1). If compare mode is
                                                                                    enabled (LINC0_MATCH = 1), a counter
                                                                                    match can generate a LINC0 interrupt. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC0_DATA_MAXIMUM ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1 Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1[DATA] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1_DATA_OFS (0)                             /* !< DATA Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1_DATA_MASK ((uint32_t)0x0000FFFFU)         /* !< 16 Bit Capture / Compare Register
                                                                                    Captures current LINCTR value on RXD
                                                                                    rising edge and can generate a LINC1
                                                                                    interrupt when capture is enabled
                                                                                    (LINC1CAP = 1) */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1_DATA_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_LINC1_DATA_MAXIMUM ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK[VALUE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address Mask for 9-Bit Mode
                                                                                    This field contains the address mask
                                                                                    that creates a set of addresses that
                                                                                    should be matched.  A 0 bit in the
                                                                                    MSK bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register is
                                                                                    don't care. A 1 bit in the MSK
                                                                                    bitfield configures, that the
                                                                                    corresponding bit in the ADDR
                                                                                    bitfield of the UARTxADDR register
                                                                                    must match. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_AMASK_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR Bits */
/* M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR[VALUE] Bits */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR_VALUE_OFS (0)                             /* !< VALUE Offset */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR_VALUE_MASK ((uint32_t)0x000000FFU)         /* !< Self Address for 9-Bit Mode  This
                                                                                    field contains the address that
                                                                                    should be matched when UARTxAMASK is
                                                                                    FFh. */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR_VALUE_MINIMUM ((uint32_t)0x00000000U)         /* !< Smallest value */
#define M33C1SPGSS0_UC2_UART_IPSPECIFIC_ADDR_VALUE_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK Bits */
/* M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK[TXINT] Bits */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Enable UART Transmit Interrupt. */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_IMASK_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS Bits */
/* M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS[TXINT] Bits */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_MASK ((uint32_t)0x00000800U)         /* !< UART Transmit Interrupt. */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC2_UART_IPSTANDARD_DMA_TRIG_TX_RIS_TXINT_SET ((uint32_t)0x00000800U)         /* !< Interrupt occurred */

