TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET[TXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_TX_ISET_TXINT_SET ((uint32_t)0x00000800U)         /* !< Set Interrupt */

/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Enable UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK[RXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Enable UART Receive Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_IMASK_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */

/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< UARTOUT Receive Time-Out Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS[RXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< UART Receive Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_RIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Masked UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Interrupt occurred */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS[RXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Masked UART Receive Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_CLR ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_MIS_RXINT_SET ((uint32_t)0x00000400U)         /* !< Interrupt occurred */

/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RTOUT_SET ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET[RXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_DMA_TRIG_RX_ISET_RXINT_SET ((uint32_t)0x00000400U)         /* !< Set Interrupt */

/* M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX[STAT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_OFS (0)                             /* !< STAT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_MASK ((uint32_t)0x000000FFU)         /* !< UART Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_NO_INTR ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_RTFG ((uint32_t)0x00000001U)         /* !< UART receive time-out interrupt;
                                                                                    Interrupt Flag: RT; Interrupt
                                                                                    Priority: Highest */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_FEFG ((uint32_t)0x00000002U)         /* !< UART framing error interrupt;
                                                                                    Interrupt Flag: FE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_PEFG ((uint32_t)0x00000003U)         /* !< UART parity error interrupt;
                                                                                    Interrupt Flag: PE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_BEFG ((uint32_t)0x00000004U)         /* !< UART break error interrupt;
                                                                                    Interrupt Flag: BE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_OEFG ((uint32_t)0x00000005U)         /* !< UART receive overrun error
                                                                                    interrupt; Interrupt Flag: OE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_RXNE ((uint32_t)0x00000006U)         /* !< Negative edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXNE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_RXPE ((uint32_t)0x00000007U)         /* !< Positive edge on UARTxRXD
                                                                                    interrupt; Interrupt Flag: RXPE */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_LINC0 ((uint32_t)0x00000008U)         /* !< LIN capture 0 / match interrupt;
                                                                                    Interrupt Flag: LINC0 */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_LINC1 ((uint32_t)0x00000009U)         /* !< LIN capture 1 interrupt; Interrupt
                                                                                    Flag: LINC1 */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_LINOVF ((uint32_t)0x0000000AU)         /* !< LIN hardware counter overflow
                                                                                    interrupt; Interrupt Flag: LINOVF */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_RXIFG ((uint32_t)0x0000000BU)         /* !< UART receive interrupt; Interrupt
                                                                                    Flag: RX */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_TXIFG ((uint32_t)0x0000000CU)         /* !< UART transmit interrupt; Interrupt
                                                                                    Flag: TX */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_EOT ((uint32_t)0x0000000DU)         /* !< UART end of transmission interrupt
                                                                                    (transmit serializer empty);
                                                                                    Interrupt Flag: EOT */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_ADDR_MATCH ((uint32_t)0x0000000EU)         /* !< 9-bit mode address match interrupt;
                                                                                    Interrupt Flag: ADDR_MATCH */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_CTS ((uint32_t)0x0000000FU)         /* !< UART Clear to Send Modem interrupt;
                                                                                    Interrupt Flag: CTS */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_DMA_DONE_RX ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_DMA_DONE_TX ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_NERR_EVT ((uint32_t)0x00000012U)         /* !< Noise Error Event */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_RX ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_DMA_PREIRQ_TX ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_IIDX_STAT_LTFG ((uint32_t)0x00000015U)         /* !< UART line time-out interrupt;
                                                                                    Interrupt Flag */

