TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR Bits */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[FRMERR] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_FRMERR_OFS (1)                             /* !< FRMERR Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_FRMERR_MASK ((uint32_t)0x00000002U)         /* !< Clear UART Framing Error Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_FRMERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_FRMERR_CLR ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[PARERR] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_PARERR_OFS (2)                             /* !< PARERR Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_PARERR_MASK ((uint32_t)0x00000004U)         /* !< Clear UART Parity Error Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_PARERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_PARERR_CLR ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[BRKERR] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_BRKERR_OFS (3)                             /* !< BRKERR Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_BRKERR_MASK ((uint32_t)0x00000008U)         /* !< Clear UART Break Error Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_BRKERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_BRKERR_CLR ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[OVRERR] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_OVRERR_OFS (4)                             /* !< OVRERR Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_OVRERR_MASK ((uint32_t)0x00000010U)         /* !< Clear UART Receive Overrun Error
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_OVRERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_OVRERR_CLR ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[RXNE] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXNE_OFS (5)                             /* !< RXNE Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXNE_MASK ((uint32_t)0x00000020U)         /* !< Clear Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXNE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXNE_CLR ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[RXPE] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXPE_OFS (6)                             /* !< RXPE Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXPE_MASK ((uint32_t)0x00000040U)         /* !< Clear Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXPE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXPE_CLR ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[LINC0] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC0_OFS (7)                             /* !< LINC0 Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC0_MASK ((uint32_t)0x00000080U)         /* !< Clear LIN Capture 0 / Match
                                                                                    Interrupt . */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC0_CLR ((uint32_t)0x00000080U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[LINC1] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC1_OFS (8)                             /* !< LINC1 Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC1_MASK ((uint32_t)0x00000100U)         /* !< Clear LIN Capture 1 Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINC1_CLR ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[LINOVF] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINOVF_OFS (9)                             /* !< LINOVF Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINOVF_MASK ((uint32_t)0x00000200U)         /* !< Clear LIN Hardware Counter Overflow
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINOVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LINOVF_CLR ((uint32_t)0x00000200U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[RXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXINT_OFS (10)                            /* !< RXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXINT_MASK ((uint32_t)0x00000400U)         /* !< Clear UART Receive Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RXINT_CLR ((uint32_t)0x00000400U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[TXINT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_TXINT_OFS (11)                            /* !< TXINT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_TXINT_MASK ((uint32_t)0x00000800U)         /* !< Clear UART Transmit Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_TXINT_CLR ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[EOT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_EOT_OFS (12)                            /* !< EOT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_EOT_MASK ((uint32_t)0x00001000U)         /* !< Clear UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_EOT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_EOT_CLR ((uint32_t)0x00001000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[ADDR_MATCH] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_ADDR_MATCH_OFS (13)                            /* !< ADDR_MATCH Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Clear Address Match Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_ADDR_MATCH_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_ADDR_MATCH_CLR ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[CTS] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_CTS_OFS (14)                            /* !< CTS Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_CTS_MASK ((uint32_t)0x00004000U)         /* !< Clear UART Clear to Send Modem
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_CTS_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_CTS_CLR ((uint32_t)0x00004000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[DMA_DONE_RX] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_RX_CLR ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[DMA_DONE_TX] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_DMA_DONE_TX_CLR ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[RTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RTOUT_OFS (0)                             /* !< RTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RTOUT_MASK ((uint32_t)0x00000001U)         /* !< Clear UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_RTOUT_CLR ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[NERR] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_NERR_OFS (17)                            /* !< NERR Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_NERR_MASK ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_NERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_NERR_CLR ((uint32_t)0x00020000U)         /* !< Clear Interrupt */
/* M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR[LTOUT] Bits */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LTOUT_OFS (20)                            /* !< LTOUT Offset */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LTOUT_MASK ((uint32_t)0x00100000U)         /* !< Clear UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define M33C1SPGSS0_UC1_UART_IPSTANDARD_ICLR_LTOUT_CLR ((uint32_t)0x00100000U)         /* !< Clear Interrupt */

