TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_spgss0.h
/* M33C1SPGSS0_FUPDATE_U1_CTS Bits */
/* M33C1SPGSS0_FUPDATE_U1_CTS[IOADDR] Bits */
#define M33C1SPGSS0_FUPDATE_U1_CTS_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS0_FUPDATE_U1_CTS_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS0_FUPDATE_U1_CTS[LOCK] Bits */
#define M33C1SPGSS0_FUPDATE_U1_CTS_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS0_FUPDATE_U1_CTS_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS0_FUPDATE_U1_CTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS0_FUPDATE_U1_CTS_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS0_FUPDATE_U1_CTS[GSEL] Bits */
#define M33C1SPGSS0_FUPDATE_U1_CTS_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS0_FUPDATE_U1_CTS_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS0_FUPDATE_U1_CTS_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS0_FUPDATE_U1_CTS_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS0_STAT_IO3 Bits */
/* M33C1SPGSS0_STAT_IO3[WAKEUP] Bits */
#define M33C1SPGSS0_STAT_IO3_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS0_STAT_IO3_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS0_STAT_IO3[PAD] Bits */
#define M33C1SPGSS0_STAT_IO3_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS0_STAT_IO3_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS0_FUPDATE_U2_SCL_RX Bits */
/* M33C1SPGSS0_FUPDATE_U2_SCL_RX[IOADDR] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_IOADDR_OFS (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_IOADDR_MASK ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS0_FUPDATE_U2_SCL_RX[LOCK] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_LOCK_OFS   (1)                             /* !< LOCK Offset */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_LOCK_MASK  ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_LOCK_LOCK  ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS0_FUPDATE_U2_SCL_RX[GSEL] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_GSEL_OFS   (0)                             /* !< GSEL Offset */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_GSEL_MASK  ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_GSEL_PCHAN ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS0_FUPDATE_U2_SCL_RX_GSEL_GCHAN ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS0_STAT_IO4 Bits */
/* M33C1SPGSS0_STAT_IO4[WAKEUP] Bits */
#define M33C1SPGSS0_STAT_IO4_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS0_STAT_IO4_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS0_STAT_IO4[PAD] Bits */
#define M33C1SPGSS0_STAT_IO4_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS0_STAT_IO4_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS0_FUPDATE_U2_SDA_TX Bits */
/* M33C1SPGSS0_FUPDATE_U2_SDA_TX[IOADDR] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_IOADDR_OFS (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_IOADDR_MASK ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS0_FUPDATE_U2_SDA_TX[LOCK] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_LOCK_OFS   (1)                             /* !< LOCK Offset */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_LOCK_MASK  ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_LOCK_LOCK  ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS0_FUPDATE_U2_SDA_TX[GSEL] Bits */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_GSEL_OFS   (0)                             /* !< GSEL Offset */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_GSEL_MASK  ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_GSEL_PCHAN ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS0_FUPDATE_U2_SDA_TX_GSEL_GCHAN ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS0_STAT_IO5 Bits */
/* M33C1SPGSS0_STAT_IO5[WAKEUP] Bits */
#define M33C1SPGSS0_STAT_IO5_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS0_STAT_IO5_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS0_STAT_IO5[PAD] Bits */
#define M33C1SPGSS0_STAT_IO5_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS0_STAT_IO5_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS0_FUPDATE_U2_RTS Bits */
/* M33C1SPGSS0_FUPDATE_U2_RTS[IOADDR] Bits */
#define M33C1SPGSS0_FUPDATE_U2_RTS_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS0_FUPDATE_U2_RTS_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS0_FUPDATE_U2_RTS[LOCK] Bits */
#define M33C1SPGSS0_FUPDATE_U2_RTS_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS0_FUPDATE_U2_RTS_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS0_FUPDATE_U2_RTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS0_FUPDATE_U2_RTS_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS0_FUPDATE_U2_RTS[GSEL] Bits */
#define M33C1SPGSS0_FUPDATE_U2_RTS_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS0_FUPDATE_U2_RTS_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS0_FUPDATE_U2_RTS_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS0_FUPDATE_U2_RTS_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

/* M33C1SPGSS0_STAT_IO6 Bits */
/* M33C1SPGSS0_STAT_IO6[WAKEUP] Bits */
#define M33C1SPGSS0_STAT_IO6_WAKEUP_OFS          (16)                            /* !< WAKEUP Offset */
#define M33C1SPGSS0_STAT_IO6_WAKEUP_MASK         ((uint32_t)0x00010000U)         /* !< This PAD has WAKEUP function
                                                                                    asserted */
/* M33C1SPGSS0_STAT_IO6[PAD] Bits */
#define M33C1SPGSS0_STAT_IO6_PAD_OFS             (0)                             /* !< PAD Offset */
#define M33C1SPGSS0_STAT_IO6_PAD_MASK            ((uint32_t)0x000000FFU)         /* !< Pad Assignment 0: No PAD is
                                                                                    assigned to this function All
                                                                                    others:Pad Number assigned to this
                                                                                    function */

/* M33C1SPGSS0_FUPDATE_U2_CTS Bits */
/* M33C1SPGSS0_FUPDATE_U2_CTS[IOADDR] Bits */
#define M33C1SPGSS0_FUPDATE_U2_CTS_IOADDR_OFS    (2)                             /* !< IOADDR Offset */
#define M33C1SPGSS0_FUPDATE_U2_CTS_IOADDR_MASK   ((uint32_t)0x0FFFFFFCU)         /* !< IO Address. This is the address
                                                                                    that corresponds to the SOC
                                                                                    address[27:2] of the module IP
                                                                                    instance specific IO signal in the
                                                                                    Full Write subregion of the pinmux
                                                                                    subregion. */
/* M33C1SPGSS0_FUPDATE_U2_CTS[LOCK] Bits */
#define M33C1SPGSS0_FUPDATE_U2_CTS_LOCK_OFS      (1)                             /* !< LOCK Offset */
#define M33C1SPGSS0_FUPDATE_U2_CTS_LOCK_MASK     ((uint32_t)0x00000002U)         /* !< Sets lock bit */
#define M33C1SPGSS0_FUPDATE_U2_CTS_LOCK_NOEFFECT ((uint32_t)0x00000000U)         /* !< Writing this value has no effect */
#define M33C1SPGSS0_FUPDATE_U2_CTS_LOCK_LOCK     ((uint32_t)0x00000002U)         /* !< Set channel lock bit */
/* M33C1SPGSS0_FUPDATE_U2_CTS[GSEL] Bits */
#define M33C1SPGSS0_FUPDATE_U2_CTS_GSEL_OFS      (0)                             /* !< GSEL Offset */
#define M33C1SPGSS0_FUPDATE_U2_CTS_GSEL_MASK     ((uint32_t)0x00000001U)         /* !< GPIO channel Select 0: Select the
                                                                                    P-Channel for the F update 1: Select
                                                                                    the G-Channel for the F update */
#define M33C1SPGSS0_FUPDATE_U2_CTS_GSEL_PCHAN    ((uint32_t)0x00000000U)         /* !< Select the P-Channel for the F
                                                                                    update */
#define M33C1SPGSS0_FUPDATE_U2_CTS_GSEL_GCHAN    ((uint32_t)0x00000001U)         /* !< Select the G-Channel for the F
                                                                                    update */

